---
kind: other
id: Properties.T:Autodesk.Revit.DB.NullParameterValue
source: html/5be216d2-ab9e-3a26-683e-4394c302b8be.htm
---
# NullParameterValue Properties

Specifies whether the .NET object represents a valid Revit entity.